const items = [
    {
        'name': '鮮綠冰茶',
        'depiction': '新鮮、甘醇的綠茶是一年四季皆可品飲的最優茶',
        'type': '經典原茶',
        'cost': '40'
    },
    {
        'name': '胭脂紅茶',
        'depiction': '阿薩姆紅茶醇厚紮實的風味，飲用時順入口喉、立即回甘',
        'type': '經典原茶',
        'cost': '40'
    },
    {
        'name': '香橙綠茶',
        'depiction': '新鮮現榨柳橙汁搭配綠茶，超新鮮的柳橙風味果茶',
        'type': '新鮮果茶',
        'cost': '70'
    },
    {
        'name': '鮮果番茄梅茶',
        'depiction': '口感香甜的聖女蕃茄加入酸梅原汁調味，酸甜滋味，永難忘懷',
        'type': '新鮮果茶',
        'cost': '80'
    },
    {
        'name': '綠抹茶冰沙',
        'depiction': '濃厚日式風味的抹茶冰沙，獨特口感推薦給您',
        'type': '限定抹茶',
        'cost': '80'
    },
    {
        'name': '抹茶冰淇淋奶綠',
        'depiction': '抹茶冰淇淋加上香濃滑順的奶綠，搭配出豐富口感',
        'type': '限定抹茶',
        'cost': '90'
    },
    {
        'name': '綠抹茶拿鐵',
        'depiction': '抹茶的香氣搭配新鮮鮮奶，絕佳的日式風味',
        'type': '限定抹茶',
        'cost': '80'
    }
];

const options = {
    'size': {
        'name': 'size',
        'title': 'Size',
        'item': ["小杯", "中杯", "大杯", "超大杯"]
    },
    'sugar': {
        'name': 'sugar',
        'title': '甜度',
        'item': ["全糖", "半糖", "少糖", "無糖"]
    },
    'ice': {
        'name': 'ice',
        'title': '冰塊',
        'item': ["正常", "少冰", "微冰", "去冰"]
    }
};